app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
  	@users = User.all
  	@posts = Post.all