app/controllers/photos_controller.rb

  def index
      @photos = Photo.all
      @like = {}
      @photos.each do |photo|
          @vote = Vote.where(photo_id: photo.id).sum(:like)
---
SELECT "photos".* FROM "photos"
SELECT  "votes".* FROM "votes" WHERE "votes"."photo_id" = ? LIMIT ?  [["photo_id", 1], ["LIMIT", 1]]
SELECT SUM("votes"."like") FROM "votes" WHERE "votes"."photo_id" = ?  [["photo_id", 1]]

  def create
  	params[:photo][:category_id] = params[:category_id]
  	params[:photo][:user_id] = current_user.id
    @photo = Photo.create(photos_params)
---
INSERT INTO "photos" ("user_id", "category_id", "name", "created_at", "updated_at", "photo") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 10], ["category_id", 3], ["name", "Dog"], ["created_at", "2017-12-03 10:50:23.335301"], ["updated_at", "2017-12-03 10:50:23.335301"], ["photo", "dog.jpg"]]

  def vote
    @photo = Photo.find(params[:id])
    @vote = Vote.where(user_id: current_user.id, photo_id: @photo.id).first
    if @vote == nil
      @like = 1
      Vote.create(user_id: current_user.id, photo_id: @photo.id, like: @like)
    else
      @vote.destroy
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."photo_id" = ? ORDER BY "votes"."id" ASC LIMIT ?  [["user_id", 1], ["photo_id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "photo_id", "like", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["photo_id", 1], ["like", 1], ["created_at", "2017-12-03 12:04:09.860395"], ["updated_at", "2017-12-03 12:04:09.860395"]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 2]]