app/controllers/posts_controller.rb

  def show
    @comments = Postcomment.where(post_id: @post.id)
---
SELECT "postcomments".* FROM "postcomments" WHERE "postcomments"."post_id" = ?  [["post_id", 6]]